synthetos/Motate/MotateProject/motate/cmsis/TARGET_Atmel/sam4l/include/instance/gpio.h
#define REG_GPIO_IMR1C2            (0x400E14B8U) /**< \brief (GPIO) Interrupt Mode Register 1 - Clear 2 */
#define REG_GPIO_IMR1T2            (0x400E14BCU) /**< \brief (GPIO) Interrupt Mode Register 1 - Toggle 2 */
#define REG_GPIO_GFER2             (0x400E14C0U) /**< \brief (GPIO) Glitch Filter Enable Register 2 */
#define REG_GPIO_GFERS2            (0x400E14C4U) /**< \brief (GPIO) Glitch Filter Enable Register - Set 2 */
#define REG_GPIO_GFERC2            (0x400E14C8U) /**< \brief (GPIO) Glitch Filter Enable Register - Clear 2 */
#define REG_GPIO_GFERT2            (0x400E14CCU) /**< \brief (GPIO) Glitch Filter Enable Register - Toggle 2 */
#define REG_GPIO_IFR2              (0x400E14D0U) /**< \brief (GPIO) Interrupt Flag Register 2 */
#define REG_GPIO_IFRC2             (0x400E14D8U) /**< \brief (GPIO) Interrupt Flag Register - Clear 2 */
#define REG_GPIO_ODMER2            (0x400E14E0U) /**< \brief (GPIO) Open Drain Mode Register 2 */
#define REG_GPIO_ODMERS2           (0x400E14E4U) /**< \brief (GPIO) Open Drain Mode Register - Set 2 */
#define REG_GPIO_ODMERC2           (0x400E14E8U) /**< \brief (GPIO) Open Drain Mode Register - Clear 2 */
#define REG_GPIO_ODMERT2           (0x400E14ECU) /**< \brief (GPIO) Open Drain Mode Register - Toggle 2 */
#define REG_GPIO_ODCR02            (0x400E1500U) /**< \brief (GPIO) Output Driving Capability Register 0 2 */
#define REG_GPIO_ODCR0S2           (0x400E1504U) /**< \brief (GPIO) Output Driving Capability Register 0 - Set 2 */
#define REG_GPIO_ODCR0C2           (0x400E1508U) /**< \brief (GPIO) Output Driving Capability Register 0 - Clear 2 */
#define REG_GPIO_ODCR0T2           (0x400E150CU) /**< \brief (GPIO) Output Driving Capability Register 0 - Toggle 2 */
#define REG_GPIO_ODCR12            (0x400E1510U) /**< \brief (GPIO) Output Driving Capability Register 1 2 */
#define REG_GPIO_ODCR1S2           (0x400E1514U) /**< \brief (GPIO) Output Driving Capability Register 1 - Set 2 */
#define REG_GPIO_ODCR1C2           (0x400E1518U) /**< \brief (GPIO) Output Driving Capability Register 1 - Clear 2 */
#define REG_GPIO_ODCR1T2           (0x400E151CU) /**< \brief (GPIO) Output Driving Capability Register 1 - Toggle 2 */
#define REG_GPIO_OSRR02            (0x400E1530U) /**< \brief (GPIO) Output Slew Rate Register 0 2 */
#define REG_GPIO_OSRR0S2           (0x400E1534U) /**< \brief (GPIO) Output Slew Rate Register 0 - Set 2 */
#define REG_GPIO_OSRR0C2           (0x400E1538U) /**< \brief (GPIO) Output Slew Rate Register 0 - Clear 2 */
#define REG_GPIO_OSRR0T2           (0x400E153CU) /**< \brief (GPIO) Output Slew Rate Register 0 - Toggle 2 */
#define REG_GPIO_STER2             (0x400E1560U) /**< \brief (GPIO) Schmitt Trigger Enable Register 2 */
#define REG_GPIO_STERS2            (0x400E1564U) /**< \brief (GPIO) Schmitt Trigger Enable Register - Set 2 */
#define REG_GPIO_STERC2            (0x400E1568U) /**< \brief (GPIO) Schmitt Trigger Enable Register - Clear 2 */
#define REG_GPIO_STERT2            (0x400E156CU) /**< \brief (GPIO) Schmitt Trigger Enable Register - Toggle 2 */
#define REG_GPIO_EVER2             (0x400E1580U) /**< \brief (GPIO) Event Enable Register 2 */
#define REG_GPIO_EVERS2            (0x400E1584U) /**< \brief (GPIO) Event Enable Register - Set 2 */
#define REG_GPIO_EVERC2            (0x400E1588U) /**< \brief (GPIO) Event Enable Register - Clear 2 */
#define REG_GPIO_EVERT2            (0x400E158CU) /**< \brief (GPIO) Event Enable Register - Toggle 2 */
#define REG_GPIO_LOCK2             (0x400E15A0U) /**< \brief (GPIO) Lock Register 2 */
#define REG_GPIO_LOCKS2            (0x400E15A4U) /**< \brief (GPIO) Lock Register - Set 2 */
#define REG_GPIO_LOCKC2            (0x400E15A8U) /**< \brief (GPIO) Lock Register - Clear 2 */
#define REG_GPIO_LOCKT2            (0x400E15ACU) /**< \brief (GPIO) Lock Register - Toggle 2 */
#define REG_GPIO_UNLOCK2           (0x400E15E0U) /**< \brief (GPIO) Unlock Register 2 */
#define REG_GPIO_ASR2              (0x400E15E4U) /**< \brief (GPIO) Access Status Register 2 */
#define REG_GPIO_PARAMETER2        (0x400E15F8U) /**< \brief (GPIO) Parameter Register 2 */
#define REG_GPIO_VERSION2          (0x400E15FCU) /**< \brief (GPIO) Version Register 2 */
#else
#define REG_GPIO_GPER0             (*(RwReg  *)0x400E1000U) /**< \brief (GPIO) GPIO Enable Register 0 */
#define REG_GPIO_GPERS0            (*(WoReg  *)0x400E1004U) /**< \brief (GPIO) GPIO Enable Register - Set 0 */
#define REG_GPIO_GPERC0            (*(WoReg  *)0x400E1008U) /**< \brief (GPIO) GPIO Enable Register - Clear 0 */
#define REG_GPIO_GPERT0            (*(WoReg  *)0x400E100CU) /**< \brief (GPIO) GPIO Enable Register - Toggle 0 */
#define REG_GPIO_PMR00             (*(RwReg  *)0x400E1010U) /**< \brief (GPIO) Peripheral Mux Register 0 0 */
#define REG_GPIO_PMR0S0            (*(WoReg  *)0x400E1014U) /**< \brief (GPIO) Peripheral Mux Register 0 - Set 0 */
#define REG_GPIO_PMR0C0            (*(WoReg  *)0x400E1018U) /**< \brief (GPIO) Peripheral Mux Register 0 - Clear 0 */
#define REG_GPIO_PMR0T0            (*(WoReg  *)0x400E101CU) /**< \brief (GPIO) Peripheral Mux Register 0 - Toggle 0 */
#define REG_GPIO_PMR10             (*(RwReg  *)0x400E1020U) /**< \brief (GPIO) Peripheral Mux Register 1 0 */
#define REG_GPIO_PMR1S0            (*(WoReg  *)0x400E1024U) /**< \brief (GPIO) Peripheral Mux Register 1 - Set 0 */
#define REG_GPIO_PMR1C0            (*(WoReg  *)0x400E1028U) /**< \brief (GPIO) Peripheral Mux Register 1 - Clear 0 */
#define REG_GPIO_PMR1T0            (*(WoReg  *)0x400E102CU) /**< \brief (GPIO) Peripheral Mux Register 1 - Toggle 0 */
#define REG_GPIO_PMR20             (*(RwReg  *)0x400E1030U) /**< \brief (GPIO) Peripheral Mux Register 2 0 */
#define REG_GPIO_PMR2S0            (*(WoReg  *)0x400E1034U) /**< \brief (GPIO) Peripheral Mux Register 2 - Set 0 */
#define REG_GPIO_PMR2C0            (*(WoReg  *)0x400E1038U) /**< \brief (GPIO) Peripheral Mux Register 2 - Clear 0 */
#define REG_GPIO_PMR2T0            (*(WoReg  *)0x400E103CU) /**< \brief (GPIO) Peripheral Mux Register 2 - Toggle 0 */
#define REG_GPIO_ODER0             (*(RwReg  *)0x400E1040U) /**< \brief (GPIO) Output Driver Enable Register 0 */
#define REG_GPIO_ODERS0            (*(WoReg  *)0x400E1044U) /**< \brief (GPIO) Output Driver Enable Register - Set 0 */
#define REG_GPIO_ODERC0            (*(WoReg  *)0x400E1048U) /**< \brief (GPIO) Output Driver Enable Register - Clear 0 */
#define REG_GPIO_ODERT0            (*(WoReg  *)0x400E104CU) /**< \brief (GPIO) Output Driver Enable Register - Toggle 0 */
#define REG_GPIO_OVR0              (*(RwReg  *)0x400E1050U) /**< \brief (GPIO) Output Value Register 0 */
#define REG_GPIO_OVRS0             (*(WoReg  *)0x400E1054U) /**< \brief (GPIO) Output Value Register - Set 0 */
#define REG_GPIO_OVRC0             (*(WoReg  *)0x400E1058U) /**< \brief (GPIO) Output Value Register - Clear 0 */
#define REG_GPIO_OVRT0             (*(WoReg  *)0x400E105CU) /**< \brief (GPIO) Output Value Register - Toggle 0 */
#define REG_GPIO_PVR0              (*(RoReg  *)0x400E1060U) /**< \brief (GPIO) Pin Value Register 0 */
#define REG_GPIO_PUER0             (*(RwReg  *)0x400E1070U) /**< \brief (GPIO) Pull-up Enable Register 0 */
#define REG_GPIO_PUERS0            (*(WoReg  *)0x400E1074U) /**< \brief (GPIO) Pull-up Enable Register - Set 0 */
#define REG_GPIO_PUERC0            (*(WoReg  *)0x400E1078U) /**< \brief (GPIO) Pull-up Enable Register - Clear 0 */
#define REG_GPIO_PUERT0            (*(WoReg  *)0x400E107CU) /**< \brief (GPIO) Pull-up Enable Register - Toggle 0 */
#define REG_GPIO_PDER0             (*(RwReg  *)0x400E1080U) /**< \brief (GPIO) Pull-down Enable Register 0 */
#define REG_GPIO_PDERS0            (*(WoReg  *)0x400E1084U) /**< \brief (GPIO) Pull-down Enable Register - Set 0 */
#define REG_GPIO_PDERC0            (*(WoReg  *)0x400E1088U) /**< \brief (GPIO) Pull-down Enable Register - Clear 0 */
#define REG_GPIO_PDERT0            (*(WoReg  *)0x400E108CU) /**< \brief (GPIO) Pull-down Enable Register - Toggle 0 */
#define REG_GPIO_IER0              (*(RwReg  *)0x400E1090U) /**< \brief (GPIO) Interrupt Enable Register 0 */
#define REG_GPIO_IERS0             (*(WoReg  *)0x400E1094U) /**< \brief (GPIO) Interrupt Enable Register - Set 0 */
#define REG_GPIO_IERC0             (*(WoReg  *)0x400E1098U) /**< \brief (GPIO) Interrupt Enable Register - Clear 0 */
#define REG_GPIO_IERT0             (*(WoReg  *)0x400E109CU) /**< \brief (GPIO) Interrupt Enable Register - Toggle 0 */
#define REG_GPIO_IMR00             (*(RwReg  *)0x400E10A0U) /**< \brief (GPIO) Interrupt Mode Register 0 0 */
#define REG_GPIO_IMR0S0            (*(WoReg  *)0x400E10A4U) /**< \brief (GPIO) Interrupt Mode Register 0 - Set 0 */
#define REG_GPIO_IMR0C0            (*(WoReg  *)0x400E10A8U) /**< \brief (GPIO) Interrupt Mode Register 0 - Clear 0 */
#define REG_GPIO_IMR0T0            (*(WoReg  *)0x400E10ACU) /**< \brief (GPIO) Interrupt Mode Register 0 - Toggle 0 */
#define REG_GPIO_IMR10             (*(RwReg  *)0x400E10B0U) /**< \brief (GPIO) Interrupt Mode Register 1 0 */
#define REG_GPIO_IMR1S0            (*(WoReg  *)0x400E10B4U) /**< \brief (GPIO) Interrupt Mode Register 1 - Set 0 */
#define REG_GPIO_IMR1C0            (*(WoReg  *)0x400E10B8U) /**< \brief (GPIO) Interrupt Mode Register 1 - Clear 0 */
#define REG_GPIO_IMR1T0            (*(WoReg  *)0x400E10BCU) /**< \brief (GPIO) Interrupt Mode Register 1 - Toggle 0 */
#define REG_GPIO_GFER0             (*(RwReg  *)0x400E10C0U) /**< \brief (GPIO) Glitch Filter Enable Register 0 */
#define REG_GPIO_GFERS0            (*(WoReg  *)0x400E10C4U) /**< \brief (GPIO) Glitch Filter Enable Register - Set 0 */
#define REG_GPIO_GFERC0            (*(WoReg  *)0x400E10C8U) /**< \brief (GPIO) Glitch Filter Enable Register - Clear 0 */
#define REG_GPIO_GFERT0            (*(WoReg  *)0x400E10CCU) /**< \brief (GPIO) Glitch Filter Enable Register - Toggle 0 */
#define REG_GPIO_IFR0              (*(RoReg  *)0x400E10D0U) /**< \brief (GPIO) Interrupt Flag Register 0 */
#define REG_GPIO_IFRC0             (*(WoReg  *)0x400E10D8U) /**< \brief (GPIO) Interrupt Flag Register - Clear 0 */
#define REG_GPIO_ODMER0            (*(RwReg  *)0x400E10E0U) /**< \brief (GPIO) Open Drain Mode Register 0 */
#define REG_GPIO_ODMERS0           (*(WoReg  *)0x400E10E4U) /**< \brief (GPIO) Open Drain Mode Register - Set 0 */
#define REG_GPIO_ODMERC0           (*(WoReg  *)0x400E10E8U) /**< \brief (GPIO) Open Drain Mode Register - Clear 0 */
#define REG_GPIO_ODMERT0           (*(WoReg  *)0x400E10ECU) /**< \brief (GPIO) Open Drain Mode Register - Toggle 0 */
#define REG_GPIO_ODCR00            (*(RwReg  *)0x400E1100U) /**< \brief (GPIO) Output Driving Capability Register 0 0 */
#define REG_GPIO_ODCR0S0           (*(RwReg  *)0x400E1104U) /**< \brief (GPIO) Output Driving Capability Register 0 - Set 0 */
#define REG_GPIO_ODCR0C0           (*(RwReg  *)0x400E1108U) /**< \brief (GPIO) Output Driving Capability Register 0 - Clear 0 */
#define REG_GPIO_ODCR0T0           (*(RwReg  *)0x400E110CU) /**< \brief (GPIO) Output Driving Capability Register 0 - Toggle 0 */
#define REG_GPIO_ODCR10            (*(RwReg  *)0x400E1110U) /**< \brief (GPIO) Output Driving Capability Register 1 0 */
#define REG_GPIO_ODCR1S0           (*(RwReg  *)0x400E1114U) /**< \brief (GPIO) Output Driving Capability Register 1 - Set 0 */
#define REG_GPIO_ODCR1C0           (*(RwReg  *)0x400E1118U) /**< \brief (GPIO) Output Driving Capability Register 1 - Clear 0 */
#define REG_GPIO_ODCR1T0           (*(RwReg  *)0x400E111CU) /**< \brief (GPIO) Output Driving Capability Register 1 - Toggle 0 */
#define REG_GPIO_OSRR00            (*(RwReg  *)0x400E1130U) /**< \brief (GPIO) Output Slew Rate Register 0 0 */
#define REG_GPIO_OSRR0S0           (*(RwReg  *)0x400E1134U) /**< \brief (GPIO) Output Slew Rate Register 0 - Set 0 */
#define REG_GPIO_OSRR0C0           (*(RwReg  *)0x400E1138U) /**< \brief (GPIO) Output Slew Rate Register 0 - Clear 0 */
#define REG_GPIO_OSRR0T0           (*(RwReg  *)0x400E113CU) /**< \brief (GPIO) Output Slew Rate Register 0 - Toggle 0 */
#define REG_GPIO_STER0             (*(RwReg  *)0x400E1160U) /**< \brief (GPIO) Schmitt Trigger Enable Register 0 */
#define REG_GPIO_STERS0            (*(RwReg  *)0x400E1164U) /**< \brief (GPIO) Schmitt Trigger Enable Register - Set 0 */
#define REG_GPIO_STERC0            (*(RwReg  *)0x400E1168U) /**< \brief (GPIO) Schmitt Trigger Enable Register - Clear 0 */
#define REG_GPIO_STERT0            (*(RwReg  *)0x400E116CU) /**< \brief (GPIO) Schmitt Trigger Enable Register - Toggle 0 */
#define REG_GPIO_EVER0             (*(RwReg  *)0x400E1180U) /**< \brief (GPIO) Event Enable Register 0 */
#define REG_GPIO_EVERS0            (*(WoReg  *)0x400E1184U) /**< \brief (GPIO) Event Enable Register - Set 0 */
#define REG_GPIO_EVERC0            (*(WoReg  *)0x400E1188U) /**< \brief (GPIO) Event Enable Register - Clear 0 */
#define REG_GPIO_EVERT0            (*(WoReg  *)0x400E118CU) /**< \brief (GPIO) Event Enable Register - Toggle 0 */
#define REG_GPIO_LOCK0             (*(RwReg  *)0x400E11A0U) /**< \brief (GPIO) Lock Register 0 */
#define REG_GPIO_LOCKS0            (*(WoReg  *)0x400E11A4U) /**< \brief (GPIO) Lock Register - Set 0 */
#define REG_GPIO_LOCKC0            (*(WoReg  *)0x400E11A8U) /**< \brief (GPIO) Lock Register - Clear 0 */
#define REG_GPIO_LOCKT0            (*(WoReg  *)0x400E11ACU) /**< \brief (GPIO) Lock Register - Toggle 0 */
#define REG_GPIO_UNLOCK0           (*(WoReg  *)0x400E11E0U) /**< \brief (GPIO) Unlock Register 0 */
#define REG_GPIO_ASR0              (*(RwReg  *)0x400E11E4U) /**< \brief (GPIO) Access Status Register 0 */
#define REG_GPIO_PARAMETER0        (*(RoReg  *)0x400E11F8U) /**< \brief (GPIO) Parameter Register 0 */
#define REG_GPIO_VERSION0          (*(RoReg  *)0x400E11FCU) /**< \brief (GPIO) Version Register 0 */
#define REG_GPIO_GPER1             (*(RwReg  *)0x400E1200U) /**< \brief (GPIO) GPIO Enable Register 1 */
#define REG_GPIO_GPERS1            (*(WoReg  *)0x400E1204U) /**< \brief (GPIO) GPIO Enable Register - Set 1 */
#define REG_GPIO_GPERC1            (*(WoReg  *)0x400E1208U) /**< \brief (GPIO) GPIO Enable Register - Clear 1 */
#define REG_GPIO_GPERT1            (*(WoReg  *)0x400E120CU) /**< \brief (GPIO) GPIO Enable Register - Toggle 1 */
#define REG_GPIO_PMR01             (*(RwReg  *)0x400E1210U) /**< \brief (GPIO) Peripheral Mux Register 0 1 */
#define REG_GPIO_PMR0S1            (*(WoReg  *)0x400E1214U) /**< \brief (GPIO) Peripheral Mux Register 0 - Set 1 */
#define REG_GPIO_PMR0C1            (*(WoReg  *)0x400E1218U) /**< \brief (GPIO) Peripheral Mux Register 0 - Clear 1 */
#define REG_GPIO_PMR0T1            (*(WoReg  *)0x400E121CU) /**< \brief (GPIO) Peripheral Mux Register 0 - Toggle 1 */
#define REG_GPIO_PMR11             (*(RwReg  *)0x400E1220U) /**< \brief (GPIO) Peripheral Mux Register 1 1 */
#define REG_GPIO_PMR1S1            (*(WoReg  *)0x400E1224U) /**< \brief (GPIO) Peripheral Mux Register 1 - Set 1 */
#define REG_GPIO_PMR1C1            (*(WoReg  *)0x400E1228U) /**< \brief (GPIO) Peripheral Mux Register 1 - Clear 1 */
#define REG_GPIO_PMR1T1            (*(WoReg  *)0x400E122CU) /**< \brief (GPIO) Peripheral Mux Register 1 - Toggle 1 */
#define REG_GPIO_PMR21             (*(RwReg  *)0x400E1230U) /**< \brief (GPIO) Peripheral Mux Register 2 1 */
#define REG_GPIO_PMR2S1            (*(WoReg  *)0x400E1234U) /**< \brief (GPIO) Peripheral Mux Register 2 - Set 1 */
#define REG_GPIO_PMR2C1            (*(WoReg  *)0x400E1238U) /**< \brief (GPIO) Peripheral Mux Register 2 - Clear 1 */
#define REG_GPIO_PMR2T1            (*(WoReg  *)0x400E123CU) /**< \brief (GPIO) Peripheral Mux Register 2 - Toggle 1 */
#define REG_GPIO_ODER1             (*(RwReg  *)0x400E1240U) /**< \brief (GPIO) Output Driver Enable Register 1 */
#define REG_GPIO_ODERS1            (*(WoReg  *)0x400E1244U) /**< \brief (GPIO) Output Driver Enable Register - Set 1 */
#define REG_GPIO_ODERC1            (*(WoReg  *)0x400E1248U) /**< \brief (GPIO) Output Driver Enable Register - Clear 1 */
#define REG_GPIO_ODERT1            (*(WoReg  *)0x400E124CU) /**< \brief (GPIO) Output Driver Enable Register - Toggle 1 */
#define REG_GPIO_OVR1              (*(RwReg  *)0x400E1250U) /**< \brief (GPIO) Output Value Register 1 */
#define REG_GPIO_OVRS1             (*(WoReg  *)0x400E1254U) /**< \brief (GPIO) Output Value Register - Set 1 */
#define REG_GPIO_OVRC1             (*(WoReg  *)0x400E1258U) /**< \brief (GPIO) Output Value Register - Clear 1 */
#define REG_GPIO_OVRT1             (*(WoReg  *)0x400E125CU) /**< \brief (GPIO) Output Value Register - Toggle 1 */
#define REG_GPIO_PVR1              (*(RoReg  *)0x400E1260U) /**< \brief (GPIO) Pin Value Register 1 */
#define REG_GPIO_PUER1             (*(RwReg  *)0x400E1270U) /**< \brief (GPIO) Pull-up Enable Register 1 */
#define REG_GPIO_PUERS1            (*(WoReg  *)0x400E1274U) /**< \brief (GPIO) Pull-up Enable Register - Set 1 */
#define REG_GPIO_PUERC1            (*(WoReg  *)0x400E1278U) /**< \brief (GPIO) Pull-up Enable Register - Clear 1 */
#define REG_GPIO_PUERT1            (*(WoReg  *)0x400E127CU) /**< \brief (GPIO) Pull-up Enable Register - Toggle 1 */
#define REG_GPIO_PDER1             (*(RwReg  *)0x400E1280U) /**< \brief (GPIO) Pull-down Enable Register 1 */
#define REG_GPIO_PDERS1            (*(WoReg  *)0x400E1284U) /**< \brief (GPIO) Pull-down Enable Register - Set 1 */
#define REG_GPIO_PDERC1            (*(WoReg  *)0x400E1288U) /**< \brief (GPIO) Pull-down Enable Register - Clear 1 */
#define REG_GPIO_PDERT1            (*(WoReg  *)0x400E128CU) /**< \brief (GPIO) Pull-down Enable Register - Toggle 1 */
#define REG_GPIO_IER1              (*(RwReg  *)0x400E1290U) /**< \brief (GPIO) Interrupt Enable Register 1 */
#define REG_GPIO_IERS1             (*(WoReg  *)0x400E1294U) /**< \brief (GPIO) Interrupt Enable Register - Set 1 */
#define REG_GPIO_IERC1             (*(WoReg  *)0x400E1298U) /**< \brief (GPIO) Interrupt Enable Register - Clear 1 */
#define REG_GPIO_IERT1             (*(WoReg  *)0x400E129CU) /**< \brief (GPIO) Interrupt Enable Register - Toggle 1 */
#define REG_GPIO_IMR01             (*(RwReg  *)0x400E12A0U) /**< \brief (GPIO) Interrupt Mode Register 0 1 */
#define REG_GPIO_IMR0S1            (*(WoReg  *)0x400E12A4U) /**< \brief (GPIO) Interrupt Mode Register 0 - Set 1 */
#define REG_GPIO_IMR0C1            (*(WoReg  *)0x400E12A8U) /**< \brief (GPIO) Interrupt Mode Register 0 - Clear 1 */
#define REG_GPIO_IMR0T1            (*(WoReg  *)0x400E12ACU) /**< \brief (GPIO) Interrupt Mode Register 0 - Toggle 1 */
#define REG_GPIO_IMR11             (*(RwReg  *)0x400E12B0U) /**< \brief (GPIO) Interrupt Mode Register 1 1 */
#define REG_GPIO_IMR1S1            (*(WoReg  *)0x400E12B4U) /**< \brief (GPIO) Interrupt Mode Register 1 - Set 1 */
#define REG_GPIO_IMR1C1            (*(WoReg  *)0x400E12B8U) /**< \brief (GPIO) Interrupt Mode Register 1 - Clear 1 */
#define REG_GPIO_IMR1T1            (*(WoReg  *)0x400E12BCU) /**< \brief (GPIO) Interrupt Mode Register 1 - Toggle 1 */
#define REG_GPIO_GFER1             (*(RwReg  *)0x400E12C0U) /**< \brief (GPIO) Glitch Filter Enable Register 1 */
#define REG_GPIO_GFERS1            (*(WoReg  *)0x400E12C4U) /**< \brief (GPIO) Glitch Filter Enable Register - Set 1 */
#define REG_GPIO_GFERC1            (*(WoReg  *)0x400E12C8U) /**< \brief (GPIO) Glitch Filter Enable Register - Clear 1 */
#define REG_GPIO_GFERT1            (*(WoReg  *)0x400E12CCU) /**< \brief (GPIO) Glitch Filter Enable Register - Toggle 1 */
#define REG_GPIO_IFR1              (*(RoReg  *)0x400E12D0U) /**< \brief (GPIO) Interrupt Flag Register 1 */
#define REG_GPIO_IFRC1             (*(WoReg  *)0x400E12D8U) /**< \brief (GPIO) Interrupt Flag Register - Clear 1 */
#define REG_GPIO_ODMER1            (*(RwReg  *)0x400E12E0U) /**< \brief (GPIO) Open Drain Mode Register 1 */
#define REG_GPIO_ODMERS1           (*(WoReg  *)0x400E12E4U) /**< \brief (GPIO) Open Drain Mode Register - Set 1 */
#define REG_GPIO_ODMERC1           (*(WoReg  *)0x400E12E8U) /**< \brief (GPIO) Open Drain Mode Register - Clear 1 */
#define REG_GPIO_ODMERT1           (*(WoReg  *)0x400E12ECU) /**< \brief (GPIO) Open Drain Mode Register - Toggle 1 */
#define REG_GPIO_ODCR01            (*(RwReg  *)0x400E1300U) /**< \brief (GPIO) Output Driving Capability Register 0 1 */
#define REG_GPIO_ODCR0S1           (*(RwReg  *)0x400E1304U) /**< \brief (GPIO) Output Driving Capability Register 0 - Set 1 */
#define REG_GPIO_ODCR0C1           (*(RwReg  *)0x400E1308U) /**< \brief (GPIO) Output Driving Capability Register 0 - Clear 1 */
#define REG_GPIO_ODCR0T1           (*(RwReg  *)0x400E130CU) /**< \brief (GPIO) Output Driving Capability Register 0 - Toggle 1 */
#define REG_GPIO_ODCR11            (*(RwReg  *)0x400E1310U) /**< \brief (GPIO) Output Driving Capability Register 1 1 */
#define REG_GPIO_ODCR1S1           (*(RwReg  *)0x400E1314U) /**< \brief (GPIO) Output Driving Capability Register 1 - Set 1 */
#define REG_GPIO_ODCR1C1           (*(RwReg  *)0x400E1318U) /**< \brief (GPIO) Output Driving Capability Register 1 - Clear 1 */
#define REG_GPIO_ODCR1T1           (*(RwReg  *)0x400E131CU) /**< \brief (GPIO) Output Driving Capability Register 1 - Toggle 1 */
#define REG_GPIO_OSRR01            (*(RwReg  *)0x400E1330U) /**< \brief (GPIO) Output Slew Rate Register 0 1 */
#define REG_GPIO_OSRR0S1           (*(RwReg  *)0x400E1334U) /**< \brief (GPIO) Output Slew Rate Register 0 - Set 1 */
#define REG_GPIO_OSRR0C1           (*(RwReg  *)0x400E1338U) /**< \brief (GPIO) Output Slew Rate Register 0 - Clear 1 */
#define REG_GPIO_OSRR0T1           (*(RwReg  *)0x400E133CU) /**< \brief (GPIO) Output Slew Rate Register 0 - Toggle 1 */
#define REG_GPIO_STER1             (*(RwReg  *)0x400E1360U) /**< \brief (GPIO) Schmitt Trigger Enable Register 1 */
#define REG_GPIO_STERS1            (*(RwReg  *)0x400E1364U) /**< \brief (GPIO) Schmitt Trigger Enable Register - Set 1 */
#define REG_GPIO_STERC1            (*(RwReg  *)0x400E1368U) /**< \brief (GPIO) Schmitt Trigger Enable Register - Clear 1 */
#define REG_GPIO_STERT1            (*(RwReg  *)0x400E136CU) /**< \brief (GPIO) Schmitt Trigger Enable Register - Toggle 1 */
#define REG_GPIO_EVER1             (*(RwReg  *)0x400E1380U) /**< \brief (GPIO) Event Enable Register 1 */
#define REG_GPIO_EVERS1            (*(WoReg  *)0x400E1384U) /**< \brief (GPIO) Event Enable Register - Set 1 */
#define REG_GPIO_EVERC1            (*(WoReg  *)0x400E1388U) /**< \brief (GPIO) Event Enable Register - Clear 1 */
#define REG_GPIO_EVERT1            (*(WoReg  *)0x400E138CU) /**< \brief (GPIO) Event Enable Register - Toggle 1 */
#define REG_GPIO_LOCK1             (*(RwReg  *)0x400E13A0U) /**< \brief (GPIO) Lock Register 1 */
#define REG_GPIO_LOCKS1            (*(WoReg  *)0x400E13A4U) /**< \brief (GPIO) Lock Register - Set 1 */
#define REG_GPIO_LOCKC1            (*(WoReg  *)0x400E13A8U) /**< \brief (GPIO) Lock Register - Clear 1 */
#define REG_GPIO_LOCKT1            (*(WoReg  *)0x400E13ACU) /**< \brief (GPIO) Lock Register - Toggle 1 */
#define REG_GPIO_UNLOCK1           (*(WoReg  *)0x400E13E0U) /**< \brief (GPIO) Unlock Register 1 */
#define REG_GPIO_ASR1              (*(RwReg  *)0x400E13E4U) /**< \brief (GPIO) Access Status Register 1 */
#define REG_GPIO_PARAMETER1        (*(RoReg  *)0x400E13F8U) /**< \brief (GPIO) Parameter Register 1 */
#define REG_GPIO_VERSION1          (*(RoReg  *)0x400E13FCU) /**< \brief (GPIO) Version Register 1 */
#define REG_GPIO_GPER2             (*(RwReg  *)0x400E1400U) /**< \brief (GPIO) GPIO Enable Register 2 */
#define REG_GPIO_GPERS2            (*(WoReg  *)0x400E1404U) /**< \brief (GPIO) GPIO Enable Register - Set 2 */
#define REG_GPIO_GPERC2            (*(WoReg  *)0x400E1408U) /**< \brief (GPIO) GPIO Enable Register - Clear 2 */
